sdaiValidateSchemaInstance(Sdai_instS*)
\details
Checks whether the population of schema instance conforms to all constrains specified in the native schema.
\param schemaInstance [in] A schema instance.
\returns
* sdaiTRUE if the constraint is satisfied.
* sdaiFALSE if the constraint is violated.
* sdaiUNKNOWN if the constraint is not defined or can not be evaluated for any reason (an EXPRESS error, incorrectly filled data, mandatory data is unset, etc.).